--- a/docs/03-supported-topologies/03-multiple-peer-to-peer-connections.md
+++ b/docs/03-supported-topologies/03-multiple-peer-to-peer-connections.md
@@ -8,16 +8,55 @@ A more real-world topology where multiple parties connect their platforms
 and each platform only has 1 role.
 (Not every party necessarily connects with all the other parties with the other role).
 
-```mermaid
-graph TB
-    eMSP1 --- CPO1
-    eMSP2 --- CPO1
-    eMSP3 --- CPO1
-    eMSP1 --- CPO2
-    eMSP2 --- CPO2
-    eMSP3 --- CPO2
-    eMSP4 --- CPO2
-    eMSP2 --- CPO3
-    eMSP3 --- CPO3
-    eMSP4 --- CPO3
+```plantuml Figure 2. Multiple peer-to-peer topology example
+@startuml
+
+skinparam agent {
+  roundCorner 8
+}
+
+skinparam rectangle {
+  roundCorner 8
+}
+
+rectangle PLATFORM as eMSPP1 {
+  agent eMSP1
+}
+
+rectangle PLATFORM as eMSPP2 {
+  agent eMSP2
+}
+
+rectangle PLATFORM as eMSPP3 {
+  agent eMSP3
+}
+
+rectangle PLATFORM as eMSPP4 {
+  agent eMSP4
+}
+
+rectangle PLATFORM as CPOP1 {
+  agent CPO1
+}
+
+rectangle PLATFORM as CPOP2 {
+  agent CPO2
+}
+
+rectangle PLATFORM as CPOP3 {
+  agent CPO3
+}
+
+eMSPP1 -- CPOP1
+eMSPP2 -- CPOP2
+eMSPP1 -- CPOP2
+eMSPP2 -- CPOP1
+eMSPP2 -- CPOP3
+eMSPP3 -- CPOP1
+eMSPP3 -- CPOP2
+eMSPP4 -- CPOP1
+eMSPP4 -- CPOP2
+eMSPP4 -- CPOP3
+
+@enduml
 ```
